In [ ]:
# шаг 3
import pandas as pd
taxi = pd.read_csv(path_to_file)

In [1]:
# шаг 4
import pandas as pd
taxi = pd.read_csv('/mnt/HC_Volume_18315164/home-jupyter/jupyter-s-bykov/lesson_2/2_taxi_nyc.csv')
taxi.shape

(29101, 14)

In [3]:
taxi.query('pickups >= 1000').head(2)

,pickup_dt,pickup_month,borough,pickups,hday,spd,vsb,temp,dewp,slp,pcp 01,pcp 06,pcp 24,sd
1,2015-01-01 01:00:00,Jan,Brooklyn,1519,Y,5.0,10.0,30.0,7.0,1023.5,0.0,0.0,0.0,0.0
3,2015-01-01 01:00:00,Jan,Manhattan,5258,Y,5.0,10.0,30.0,7.0,1023.5,0.0,0.0,0.0,0.0

In [7]:
import datetime
from datetime import datetime
now = datetime.now()
print(f'Full time format of now is {now}')

Full time format of now is 2022-05-29 18:56:53.862731

In [15]:
taxi.dtypes # шаг 5

pickup_dt        object
pickup_month     object
borough          object
pickups           int64
hday             object
spd             float64
vsb             float64
temp            float64
dewp            float64
slp             float64
pcp 01          float64
pcp 06          float64
pcp 24          float64
sd              float64
dtype: object

In [17]:
taxi = taxi.rename(columns={'pcp 01' : 'pcp_01', 'pcp 06' : 'pcp_06', 'pcp 24' : 'pcp_24'}) # шаг 6

In [36]:
taxi.borough.value_counts() # шаг 7

Staten Island    4343
Queens           4343
EWR              4343
Manhattan        4343
Brooklyn         4343
Bronx            4343
Name: borough, dtype: int64

In [33]:
taxi.pickups.sum() # шаг 8

14265773

In [43]:
taxi.groupby('borough').agg({'pickups': sum}).sort_values('pickups') # шаг 9

                pickups
borough
EWR                 105
Staten Island      6957
Bronx            220047
Queens          1343528
Brooklyn        2321035
Manhattan      10367841

In [ ]:
# шаг 10

In [47]:
taxi.groupby(['borough', 'hday']).agg({'pickups': 'mean'}) # шаг 11

                        pickups
borough       hday
Bronx         N       50.771073
              Y       48.065868
Brooklyn      N      534.727969
              Y      527.011976
EWR           N        0.023467
              Y        0.041916
Manhattan     N     2401.302921
              Y     2035.928144
Queens        N      308.899904
              Y      320.730539
Staten Island N        1.606082
              Y        1.497006

In [9]:
pickups_by_mon_bor = taxi.groupby(['borough', 'pickup_month'], as_index=False).agg({'pickups': sum}).sort_values('pickups', ascending=False)
# шаг 12

In [ ]:
# шаг 13

In [1]:
import pandas as pd
df=pd.read_csv('/mnt/HC_Volume_18315164/home-jupyter/jupyter-s-bykov/lesson_2/lesson_1_data.csv', encoding='windows-1251', sep=';')

In [3]:
df.head()

,Номер,Дата создания,Дата оплаты,Title,Статус,Заработано,Город,Платежная система
0,1062823,01.12.2019 10:50,01.12.2019 10:52,Курс обучения «Эксперт»,Завершен,29597.5,Чита,Сбербанк эквайринг
1,1062855,01.12.2019 20:53,01.12.2019 21:27,Курс обучения «Эксперт»,Завершен,17450.3,Краснодар,Яндекс.Касса
2,1062856,01.12.2019 21:43,NaN,Курс обучения «Специалист»,Отменен,0.0,NaN,NaN
3,1062880,03.12.2019 0:18,NaN,Курс обучения «Консультант»,Отменен,0.0,г.Москва и Московская область,NaN
4,1062899,03.12.2019 21:43,NaN,Курс обучения «Эксперт»,Отменен,0.0,г.Москва и Московская область,NaN

In [2]:
df=df.rename(columns={'Номер': 'number', 
               'Дата создания': 'create_date', 
               'Дата оплаты': 'payment_date', 
               'Title': 'tittle', 
               'Статус': 'status',
               'Заработано': 'money', 
               'Город': 'city', 
               'Платежная система': 'payment_system'})

In [3]:
df.head()

,number,create_date,payment_date,tittle,status,money,city,payment_system
0,1062823,01.12.2019 10:50,01.12.2019 10:52,Курс обучения «Эксперт»,Завершен,29597.5,Чита,Сбербанк эквайринг
1,1062855,01.12.2019 20:53,01.12.2019 21:27,Курс обучения «Эксперт»,Завершен,17450.3,Краснодар,Яндекс.Касса
2,1062856,01.12.2019 21:43,NaN,Курс обучения «Специалист»,Отменен,0.0,NaN,NaN
3,1062880,03.12.2019 0:18,NaN,Курс обучения «Консультант»,Отменен,0.0,г.Москва и Московская область,NaN
4,1062899,03.12.2019 21:43,NaN,Курс обучения «Эксперт»,Отменен,0.0,г.Москва и Московская область,NaN

In [15]:
df.groupby('tittle').agg({'money': 'sum', 'number': 'count'})

                                                        money  number
tittle
Курс обучения «Консультант»                         208163.49      52
Курс обучения «Специалист»                          160862.64      12
Курс обучения «Эксперт»                             148992.80      22
Курс от Школы Диетологов. Бизнес                     18752.54       9
Курс от Школы Диетологов. Повышение квалификации.    88384.92      15
Подписка «ОНЛАЙН ДИЕТОЛОГ» с ежемесячным автосп...  366947.20     182

In [17]:
df.groupby('tittle', as_index=False).sum().sort_values('money', ascending=False)

                                              tittle     number      money
5  Подписка «ОНЛАЙН ДИЕТОЛОГ» с ежемесячным автос...  193602494  366947.20
0                        Курс обучения «Консультант»   55308909  208163.49
1                         Курс обучения «Специалист»   12765111  160862.64
2                            Курс обучения «Эксперт»   23394633  148992.80
4  Курс от Школы Диетологов. Повышение квалификац...   15964703   88384.92
3                   Курс от Школы Диетологов. Бизнес    9577770   18752.54

In [19]:
df.tittle.value_counts()

Подписка «ОНЛАЙН ДИЕТОЛОГ» с ежемесячным автосписанием    182
Курс обучения «Консультант»                                52
Курс обучения «Эксперт»                                    22
Курс от Школы Диетологов. Повышение квалификации.          15
Курс обучения «Специалист»                                 12
Курс от Школы Диетологов. Бизнес                            9
Name: tittle, dtype: int64

In [11]:
money_title = df \
    .query("status == 'Завершен'") \
    .groupby(['tittle'], as_index=False) \
    .aggregate({'money': 'sum', 'number': 'count'})
money_title

                                              tittle      money  number
0                        Курс обучения «Консультант»  208163.49      31
1                         Курс обучения «Специалист»  160862.64       7
2                            Курс обучения «Эксперт»  148992.80       5
3                   Курс от Школы Диетологов. Бизнес   18752.54       3
4  Курс от Школы Диетологов. Повышение квалификац...   88384.92       9
5  Подписка «ОНЛАЙН ДИЕТОЛОГ» с ежемесячным автос...  366947.20     125

In [12]:
money_title = df \
    .query("status == 'Завершен'") \
    .aggregate({'money': 'sum', 'number': 'count'})
money_title

money     992103.59
number       180.00
dtype: float64